
public class Soldier {
	
	// Ιδιωτική ιδιότητα id που αποθηκεύει το μοναδικό αναγνωριστικό του στρατιώτη
	private String id;
	
	// Στατική ιδιότητα counter για να μετράει τον συνολικό αριθμό των αντικειμένων Soldier
	// Δεν ανήκει σε κάθε αντικείμενο Soldier, αλλά είναι κοινή για όλα τα αντικείμενα της κλάσης.
	private static int counter = 0;
	
	// Κατασκευαστής της κλάσης Soldier
	// Δέχεται ως παράμετρο ένα μοναδικό αναγνωριστικό (anID) και το αποθηκεύει στο id του αντικειμένου
	// Αυξάνει επίσης τον στατικό μετρητή counter κατά 1 με κάθε δημιουργία νέου αντικειμένου Soldier
	public Soldier(String anID) {
		id = anID;
		counter++;
	}

	// Στατική μέθοδος που επιστρέφει την τιμή του counter
	// Εφόσον είναι στατική, μπορεί να κληθεί χωρίς να δημιουργηθεί αντικείμενο Soldier
	public static int getCounter() {
		return counter;
	}

}