// Η κλάση Keyboard επεκτείνει την αφηρημένη κλάση Input, και αποτελεί
// συγκεκριμένη υλοποίηση για την εισαγωγή δεδομένων από το πληκτρολόγιο.
public class Keyboard extends Input {

	// Υλοποιούμε την αφηρημένη μέθοδο read() από την κλάση Input με την
	// ένδειξη @Override για να δείξουμε ότι η μέθοδος υπερισχύει (overrides).
	@Override
	public int read() {
		// Σε αυτό το παράδειγμα, επιστρέφουμε την τιμή 5 ως τιμή εισόδου.
		// Κανονικά, η μέθοδος αυτή θα διάβαζε δεδομένα από το πληκτρολόγιο.
		int x = 5;
		return x;
	}
}

/*
Η κλάση Keyboard επεκτείνει την αφηρημένη κλάση Input και παρέχει μια συγκεκριμένη υλοποίηση για τη μέθοδο read(), 
η οποία κανονικά θα χρησιμοποιούνταν για την ανάγνωση δεδομένων από το πληκτρολόγιο. 
Στο παράδειγμα, η read() επιστρέφει την τιμή 5 αντί να λαμβάνει πραγματική είσοδο από τον χρήστη, 
αλλά η δομή της κλάσης μας δείχνει πώς μπορούμε να δημιουργήσουμε μια κλάση εισόδου δεδομένων 
που να ειδικεύεται για πληκτρολόγιο.
*/