
public class Main {

    // static: Μια στατική μέθοδος μπορεί να κληθεί χωρίς να φτιαχτεί αντικείμενο της κλάσης,
	// χρησιμοποιώντας κατευθείαν το όνομα της κλάσης.
    // String[] args δηλώνει αλφαριθμητικό πίνακα
	public static void main(String[] args) {
        // Κρατάει μια αναφορά, την διεύθυνση της μνήμης που είναι το αντικείμενο
        TicketMachine bus14 = new TicketMachine(90); //το 90 λέγεται πραγματική παράμετρος ή όρισμα
        
        // Στο αντικείμενο καλώ μια μέθοδο της κλάσης
        bus14.setPrice(80);
        // Εκτυπώνω ένα μήνυμα
        System.out.println("Μάστορα, new ticket price = " + bus14.getPrice() + " cents");
        
        // Εισάγω τα κέρματα
        bus14.insertMoney(50);
        bus14.insertMoney(2);
        
        // Καλώ μια μέθοδο στο αντικείμενο. Η μέθοδος είναι αυτή της εκτύπωσης
        bus14.printTicket();

	}

}
