
public class Math {

	// Σταθερά pi που αναπαριστά την τιμή του π (προσεγγιστικά)
	// Η λέξη-κλειδί final δηλώνει ότι η τιμή της δεν μπορεί να αλλάξει
	// Δεν πρέπει να δημιουργούμε αντικείμενο και να καλούμε λειτουργίες
	// Είναι μια κλάση που περιέχει σταθερές
	public static final double pi = 3.14;
	
	// Στατική μέθοδος abs που δέχεται έναν ακέραιο n και επιστρέφει την απόλυτη τιμή του
	public static int abs(int n)
	{
		if (n<0)
			return -n; // Αν ο αριθμός είναι αρνητικός, επιστρέφει την θετική τιμή του
		return n; // Αν είναι θετικός ή μηδέν, επιστρέφει την αρχική τιμή
	}
}