
public class TestClass {

	// Η κύρια μέθοδος όπου εκτελείται το πρόγραμμα
	public static void main(String[] args) {
		
		// Δημιουργία μιας ακέραιας μεταβλητής x
		int x;
		x = 10;
		
		// Εκτύπωση της απόλυτης τιμής του x χρησιμοποιώντας την στατική μέθοδο abs της κλάσης Math
		System.out.println(Math.abs(x)); // Αποτέλεσμα: 10
	
		// Αλλαγή της τιμής του x σε -10
		x = -10;
		
		// Εκτύπωση της απόλυτης τιμής του x χρησιμοποιώντας την στατική μέθοδο abs της κλάσης Math
		System.out.println(Math.abs(x)); // Αποτέλεσμα: 10
	
		
		// Δημιουργία και εκτύπωση μιας μεταβλητής y που είναι το αποτέλεσμα του x επί την σταθερά pi της κλάσης Math
		double y = x * Math.pi; 
		System.out.println(y); // Αποτέλεσμα: -31.4
	}

}
