/*Ο κώδικας αυτός χρησιμοποιείται για τη διαχείριση σημειώσεων ενός χρήστη. 
 * Εισάγοντας ονοματεπώνυμο και αριθμό σημειώσεων, το πρόγραμμα δημιουργεί ένα αντικείμενο Notebook 
 * που αποθηκεύει τις σημειώσεις του χρήστη. 
 * Η χρήση επαναληπτικής δομής επιτρέπει την προσθήκη σημειώσεων με ευκολία, ενώ μέθοδοι όπως 
 * listNotes, showNote, και removeNote παρέχουν βασική λειτουργικότητα για την προβολή και διαχείριση των σημειώσεων.
 */

import java.util.Scanner;

public class Main {

	public static void main(String[] args) {
		// Χρησιμοποιούμε το Scanner για να ζητήσουμε δεδομένα από τον χρήστη μέσω πληκτρολογίου
		Scanner input = new Scanner(System.in); // System.in εισαγωγή από πληκτρολόγιο
		
		// Εμφανίζουμε το μήνυμα για εισαγωγή ονόματος χωρίς αλλαγή γραμμής. Δεν βάζω το ln για MHN να αλλάξει γραμμή
		System.out.print("Enter owner name? ");
		
		// Διαβάζουμε το όνομα του ιδιοκτήτη που εισάγει ο χρήστης
		String owner = input.nextLine();   // nextLine: διαβάζει αλφαριθμητικό που εισήγαγε ο χρήστης
		
		// Δημιουργούμε ένα νέο αντικείμενο Notebook με όνομα ιδιοκτήτη αυτό που μόλις εισάχθηκε
		Notebook myNotebook = new Notebook(owner); 

		// Εμφανίζουμε το μήνυμα για εισαγωγή αριθμού σημειώσεων. Δεν βάζω το ln για MHN να αλλάξει γραμμή
		System.out.print("Number of notes? ");
		
		// Διαβάζουμε τον αριθμό των σημειώσεων από το πληκτρολόγιο
		int num = input.nextInt();

		// Καθαρίζουμε τον buffer για να μην διαβαστεί κατά λάθος το Enter του προηγούμενου input
	    // Αλλιώς θα δείχνει num φορές το Enter a note?
	    input.nextLine(); // SOS καθαρισμός του Buffer της αλλαγής γραμμής
	    
	    // Επαναληπτική δομή για εισαγωγή σημειώσεων
		for(int i=0;i<num;i++) {
		    
			// Εμφανίζουμε το μήνυμα για εισαγωγή σημείωσης. Δεν βάζω το ln για MHN να αλλάξει γραμμή
			System.out.print("Enter a note bre? ");
			
			// Διαβάζουμε τη σημείωση που εισάγει ο χρήστης
			String note = input.nextLine();
	
			// Αποθηκεύουμε τη σημείωση στο αντικείμενο myNotebook
			myNotebook.storeNote(note);
		}
		
		// Εκτύπωση σημειώσεων
		
		// Εκτυπώνουμε όλες τις σημειώσεις που αποθηκεύτηκαν
		myNotebook.listNotes();
		
		// Εμφανίζουμε μια συγκεκριμένη σημείωση βάσει του αριθμού γραμμής που εισάγεται
		myNotebook.showNote(10);
		
		// Διαγράφουμε τη σημείωση με τον δείκτη 0
		myNotebook.removeNote(0);
		
		/* Εναλλακτικά, τα δυο παραπάνω, μπορούμε να ζητάμε από τον χρήστη να εισάγει τα νούμερα για
		 εκτύπωση του αριθμού σημείωσης και την διαγραφή της σημείωσης.
		*/
	}

}