
// Η κλάση Circle επεκτείνει (extends) την αφηρημένη κλάση Shape, επομένως είναι
// μια εξειδικευμένη υλοποίηση ενός σχήματος που αντιπροσωπεύει τον κύκλο.
public class Circle extends Shape {

	// Υλοποιούμε την αφηρημένη μέθοδο draw() από την κλάση Shape, με την
	// ένδειξη @Override για να δείξουμε ότι πρόκειται για υπερισχύουσα (overridden) μέθοδο.
	@Override
	public void draw() {
		// Εδώ, εκτυπώνουμε ένα μήνυμα που δείχνει ότι σχεδιάζεται ένας κύκλος.
		System.out.println("A circle is drawn");
		
	}
}

/*
Η κλάση Circle επεκτείνει την αφηρημένη κλάση Shape και παρέχει την υλοποίηση της μεθόδου draw(). 
Με την υπερκάλυψη (override) της μεθόδου, μπορούμε να καθορίσουμε ότι όταν σχεδιάζεται ένας κύκλος, 
εμφανίζεται ένα συγκεκριμένο μήνυμα στην οθόνη. Έτσι, η κλάση Circle υλοποιεί την draw() με συγκεκριμένη λειτουργία, 
σε αντίθεση με την αφηρημένη Shape, που δεν είχε ορισμένη συμπεριφορά για το σχέδιο.
*/