
// Η κλάση Square επεκτείνει την αφηρημένη κλάση Shape, επομένως αποτελεί
// συγκεκριμένη υλοποίηση ενός σχήματος που αντιπροσωπεύει το τετράγωνο.
public class Square extends Shape {

	// Υλοποιούμε την αφηρημένη μέθοδο draw() από την κλάση Shape με την
	// ένδειξη @Override για να δείξουμε ότι η μέθοδος υπερισχύει (overrides).
	@Override
	public void draw() {
		// Εδώ, εκτυπώνεται ένα μήνυμα που δείχνει ότι σχεδιάζεται ένα τετράγωνο.
		System.out.println("A square is drawn");
		
	}
}

/*
Η κλάση Square επεκτείνει την αφηρημένη κλάση Shape και υλοποιεί την αφηρημένη μέθοδο draw(). 
Με την υπερκάλυψη της draw(), δίνουμε συγκεκριμένη λειτουργία για το σχήμα του τετραγώνου, 
ώστε κάθε φορά που καλείται η μέθοδος, εμφανίζεται ένα μήνυμα που υποδεικνύει ότι σχεδιάζεται ένα τετράγωνο. 
Έτσι, η Square διατηρεί τη δυνατότητα της Shape ως βάση, αλλά προσθέτει τη δική της μοναδική υλοποίηση για τη σχεδίαση.
*/