/*
 Ο κώδικας χρησιμοποιεί την κλάση περιτύλιξης Integer για τη διαχείριση ακεραίων στην ArrayList. 
 Αυτό απαιτείται καθώς οι συλλογές Java αποθηκεύουν αντικείμενα και όχι πρωτογενείς τύπους (όπως int). 
 Η αυτόματη πλαισίωση (autoboxing) επιτρέπει τη μετατροπή των int σε Integer κατά την προσθήκη στη συλλογή, 
 και η αυτόματη αποπλαισίωση (auto-unboxing) επιτρέπει την ανάκτηση ως int κατά την πρόσβαση. 
 Αυτή η τεχνική διευκολύνει την εργασία με συλλογές, όπου οι πρωτογενείς τύποι πρέπει να αντιμετωπίζονται 
 ως αντικείμενα για ευελιξία και συμβατότητα με το Java Collections Framework.
 */

import java.util.ArrayList;

public class Main {

	public static void main(String[] args) {
		
		// Η ArrayList αποθηκεύει αντικείμενα τύπου Integer, και όχι απλά αριθμούς int
        // Χρησιμοποιούμε την κλάση περιτύλιξης Integer για να διαχειριστούμε int τιμές ως αντικείμενα
		ArrayList<Integer> numbers = new ArrayList<>();

		// ΤΗΝ ΚΛΑΣΗ ΠΕΡΙΤΥΛΙΞΗΣ ΘΑ ΤΟ ΔΕΙΣ ΣΤΟ ΜΑΘΗΜΑ 3
		
        // Τρόποι προσθήκης αντικειμένων - ακεραίων αριθμών στη λίστα numbers
        // Autoboxing (αυτόματη πλαισίωση): αυτόματη μετατροπή των int σε αντικείμενα τύπου Integer
		
		Integer num1 = new Integer(34); // Δημιουργία νέου αντικειμένου τύπου Integer
		numbers.add(num1); // Προσθήκη του num1 στη λίστα
		
		numbers.add(new Integer(67)); // Προσθήκη νέου αντικειμένου Integer απευθείας στην λίστα
		
		int num2 = 789; // Δημιουργία μεταβλητής τύπου int και ανάθεση τιμής
		numbers.add(num2); // Autoboxing: το int num2 μετατρέπεται αυτόματα σε Integer
		
		numbers.add(2456); // Autoboxing: ο αριθμός 2456 μετατρέπεται σε Integer και προστίθεται στη λίστα
		
		// Ανάκτηση δεδομένων από τη λίστα
		num2 = numbers.get(0); // Auto-unboxing: μετατροπή του Integer στο int
		System.out.println(num2); // Εμφάνιση της τιμής του πρώτου στοιχείου
		
	}

}